20240504T224810--kdoc-165-メモの課題と対応策__structure.org
:properties:
:ID: 20240504T224810
:end:
#+title:      KDOC 165: メモの課題と対応策
#+date:       [2024-05-04 Sat 22:48]
#+filetags:   :structure:
#+identifier: 20240504T224810

* この文書のステータス
- 作成
  - [X] 2024-05-09 貴島
- レビュー
  - [ ] <署名>

* 概要
この文書は構造メモで、集積したトピックのリンク集である。

ツェッテルカステンライクなメモを取るにあたって、課題を書いたメモが増えてきたため構造化する。
* 問題意識

- [[id:20240501T152929][KDOC 150: メモに関連を作れない理由]]
- [[id:20240502T172812][KDOC 153: すでにあるメモから、関連させられないか考える]]
- [[id:20240502T173223][KDOC 154: 悪いメモの例]]
- [[id:20240502T175719][KDOC 155: 文献メモには内容のメモしか書かないようにする]]
- [[id:20240503T175611][KDOC 156: 深く理解できないのは疑問を持たないから]]
- [[id:20240503T181657][KDOC 157: 今のメモで足りないこと]]
- [[id:20240503T192408][KDOC 158: 記録として書くだけでは意味があまりない]]

* 改善のための取り組み

- [[id:20240504T133130][KDOC 161: KDOCの目的]]
- [[id:20240505T012745][KDOC 166: KDOCは何ではない]]
- [[id:20240506T124926][KDOC 168: メモに書く必要のないこと]]

* 参考文献

- [[id:20231008T203658][KDOC 36: 『TAKE NOTES!』]]
- [[id:20240504T163507][KDOC 164: 『Obsidianでつなげる情報管理術』]]

* 考察

- [[id:20231009T163508][KDOC 39: ツェッテルカステンとwikiの違いは、考えか事実か]]

* 既存の規約

- [[id:20231009T155942][KDOC 38: ツェッテルカステンのやり方]]
