20240504T224810--kdoc-165-メモの課題と対応策__structure.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-06-05 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 165: メモの課題と対応策</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 165: メモの課題と対応策</h1>

<div id="outline-container-orgb99981b" class="outline-2">
<h2 id="orgb99981b"><a href="#orgb99981b">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgb99981b">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-09 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgead6bc3" class="outline-2">
<h2 id="orgead6bc3"><a href="#orgead6bc3">概要</a></h2>
<div class="outline-text-2" id="text-orgead6bc3">
<p>
この文書は構造メモで、集積したトピックのリンク集である。
</p>

<p>
ツェッテルカステンライクなメモを取るにあたって、課題を書いたメモが増えてきたため構造化する。
</p>
</div>
</div>
<div id="outline-container-org3e62a32" class="outline-2">
<h2 id="org3e62a32"><a href="#org3e62a32">問題意識</a></h2>
<div class="outline-text-2" id="text-org3e62a32">
<ul class="org-ul">
<li><a href="20240501T152929--kdoc-150-メモに関連を作れない理由__essay.html#ID-20240501T152929">KDOC 150: メモに関連を作れない理由</a></li>
<li><a href="20240502T172812--kdoc-153-すでにあるメモから、関連させられないか考える__essay.html#ID-20240502T172812">KDOC 153: すでにあるメモから、関連させられないか考える</a></li>
<li><a href="20240502T173223--kdoc-154-よくないメモの例__essay.html#ID-20240502T173223">KDOC 154: 悪いメモの例</a></li>
<li><a href="20240502T175719--kdoc-155-文献メモには内容のメモしか書かないようにする__essay.html#ID-20240502T175719">KDOC 155: 文献メモには内容のメモしか書かないようにする</a></li>
<li><a href="20240503T175611--kdoc-156-深く理解できないのは疑問を持たないから__essay.html#ID-20240503T175611">KDOC 156: 深く理解できないのは疑問を持たないから</a></li>
<li><a href="20240503T181657--kdoc-157-今のメモで足りないこと__essay.html#ID-20240503T181657">KDOC 157: 今のメモで足りないこと</a></li>
<li><a href="20240503T192408--kdoc-158-記録として書くだけでは意味があまりない__essay.html#ID-20240503T192408">KDOC 158: 記録として書くだけでは意味があまりない</a></li>
</ul>
</div>
</div>

<div id="outline-container-org749d75d" class="outline-2">
<h2 id="org749d75d"><a href="#org749d75d">改善のための取り組み</a></h2>
<div class="outline-text-2" id="text-org749d75d">
<ul class="org-ul">
<li><a href="20240504T133130--kdoc-161-kdocの目的__essay.html#ID-20240504T133130">KDOC 161: KDOCの目的</a></li>
<li><a href="20240505T012745--kdoc-166-kdocは何ではない__essay.html#ID-20240505T012745">KDOC 166: KDOCは何ではない</a></li>
<li><a href="20240506T124926--kdoc-168-メモに書く必要のないこと__essay.html#ID-20240506T124926">KDOC 168: メモに書く必要のないこと</a></li>
</ul>
</div>
</div>

<div id="outline-container-org24ea8ae" class="outline-2">
<h2 id="org24ea8ae"><a href="#org24ea8ae">参考文献</a></h2>
<div class="outline-text-2" id="text-org24ea8ae">
<ul class="org-ul">
<li><a href="20231008T203658--kdoc-36-『take-notes』__book.html#ID-20231008T203658">KDOC 36: 『TAKE NOTES!』</a></li>
<li><a href="20240504T163507--kdoc-164-『obsidianでつなげる情報管理術』__book.html#ID-20240504T163507">KDOC 164: 『Obsidianでつなげる情報管理術』</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb256ada" class="outline-2">
<h2 id="orgb256ada"><a href="#orgb256ada">考察</a></h2>
<div class="outline-text-2" id="text-orgb256ada">
<ul class="org-ul">
<li><a href="20231009T163508--kdoc-39-ツェッテルカステンとwikiの違いは、考えか事実か__essay.html#ID-20231009T163508">KDOC 39: ツェッテルカステンとwikiの違いは、考えか事実か</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9209861" class="outline-2">
<h2 id="org9209861"><a href="#org9209861">既存の規約</a></h2>
<div class="outline-text-2" id="text-org9209861">
<ul class="org-ul">
<li><a href="20231009T155942--kdoc-38-ツェッテルカステンのやり方__essay.html#ID-20231009T155942">KDOC 38: ツェッテルカステンのやり方</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
